CFDEM/CFDEMcoupling/tutorials/cfdemCatalyticMass/packedBedIsothermal-mass-PA-ISAT/CFD/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 7.7);

boundaryField
{

    wall
    {
        type            slip;
    }

    inlet
    {
        type            interstitialUniformInletVelocity;
        inletVelocity   constant (0 0 5.0);
        alpha           voidfraction;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
