CFDEM/CFDEMcoupling/tutorials/cfdemCatalyticMass/packedBedIsothermal-mass-PA-ISAT/CFD/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1098.15;

boundaryField
{
    wall
    {
        type        zeroGradient;
    }
    
    inlet
    {
        type        fixedValue;
        value		uniform 1098.15;
    }

    outlet
    {
        type        zeroGradient;
    }
}

// ************************************************************************* //
